Revit 2026 API

# ExternalResourceMatchOptions Properties

---

The ExternalResourceMatchOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ResourceType | The desired resource type which external resources should match. |

#### Reference

ExternalResourceMatchOptions Class

Autodesk.Revit.DB Namespace